      *================================================================*
      * DAUF.cpy                                                       *
      *================================================================*

       01  UAO-FILE-OUT.
        02 UAO-ID PIC X(15).
        02 UAO-CB PIC S9(12)V99.
        02 UAO-DL PIC 9(12)V99.
        02 UAO-DS PIC 9(12)V99. 
