      *================================================================*
      * WPL.cpy                                                        *
      *================================================================*
       01  :NAME:-PL-STATE PIC X(1) VALUE 'N'.
        88 :NAME:-PL-DONE VALUE 'Y'.
        88 :NAME:-PL-NOT-DONE VALUE 'N'.

       
