      *================================================================*
      * WTI.cpy                                                        *
      *================================================================*
       01  :NAME:-TI-IDX PIC 9(4) VALUE ZERO.
       01  :NAME:-TI-CTR PIC 9(4) VALUE ZERO.
       01  :NAME:-TI-STATE PIC X(1) VALUE 'N'.
        88 :NAME:-TI-DONE VALUE 'Y'.
        88 :NAME:-TI-NOT-DONE VALUE 'N'.
